In [669]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [402]:
import pandas as pd
import numpy as np
numbers = np.random.randn(5)
s = pd.Series(numbers)
s

0    0.552288
1    0.811151
2    0.699262
3    1.605140
4   -0.979997
dtype: float64

In [403]:
idx = ['a','b','c','d','e']
s = pd.Series(numbers, index=idx)
s

a    0.552288
b    0.811151
c    0.699262
d    1.605140
e   -0.979997
dtype: float64

In [404]:
s = pd.Series([2,3,5,7,11])
s[0]

2

In [405]:
s[1:3]

1    3
2    5
dtype: int64

In [406]:
s[-1]

KeyError: -1

In [407]:
type(s[1:3])

pandas.core.series.Series

In [408]:
type(s[0])

numpy.int64

In [409]:
s = pd.Series([2,3,5,7,11], index=['a','a','a','a','a'])
s

a     2
a     3
a     5
a     7
a    11
dtype: int64

In [410]:
s['a']

a     2
a     3
a     5
a     7
a    11
dtype: int64

In [411]:
idx = ['g','o','a','t','s']
s = pd.Series(numbers, index=idx)
s

g    0.552288
o    0.811151
a    0.699262
t    1.605140
s   -0.979997
dtype: float64

In [412]:
s['g':'t']

g    0.552288
o    0.811151
a    0.699262
t    1.605140
dtype: float64

In [413]:
d = {'dog':3.1415,'cat':42,'bird':0,'goat':1.618}
s = pd.Series(d)
s

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
dtype: float64

In [414]:
inds = ['dog','cat','bird','goat','cthulu']
s = pd.Series(d, index=inds)
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu        NaN
dtype: float64

In [415]:
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu        NaN
dtype: float64

In [416]:
s[s>0]

dog      3.1415
cat     42.0000
goat     1.6180
dtype: float64

In [417]:
s**2

dog          9.869022
cat       1764.000000
bird         0.000000
goat         2.617924
cthulu            NaN
dtype: float64

In [418]:
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu        NaN
dtype: float64

In [419]:
s['goat']

1.6180000000000001

In [420]:
s['cthulu']=-1
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu    -1.0000
dtype: float64

In [421]:
s['penguin']

KeyError: 'penguin'

In [422]:
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu    -1.0000
dtype: float64

In [423]:
s['cthulu'] = (1,1)

ValueError: setting an array element with a sequence.

In [ ]:
s['cthulu'] = 'abcde'

In [424]:
s

dog        3.1415
cat       42.0000
bird       0.0000
goat       1.6180
cthulu    -1.0000
dtype: float64

In [425]:
s + 2*s

dog         9.4245
cat       126.0000
bird        0.0000
goat        4.8540
cthulu     -3.0000
dtype: float64

In [426]:
2*s

dog        6.283
cat       84.000
bird       0.000
goat       3.236
cthulu    -2.000
dtype: float64

In [427]:
d = {'dog':2,'cat':1.23456}
t = pd.Series(d)
t

cat    1.23456
dog    2.00000
dtype: float64

In [428]:
s+t

bird           NaN
cat       43.23456
cthulu         NaN
dog        5.14150
goat           NaN
dtype: float64

In [429]:
d = {'dog':3.1415,'cat':42,'bird':0,'goat':1.618}
s = pd.Series(d)
s

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
dtype: float64

In [430]:
s

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
dtype: float64

In [431]:
s.name = 'aminals'
s

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
Name: aminals, dtype: float64

In [432]:
s.rename('animals')

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
Name: animals, dtype: float64

In [433]:
s

bird     0.0000
cat     42.0000
dog      3.1415
goat     1.6180
Name: aminals, dtype: float64

In [434]:
d = {'A':pd.Series([1,2,3], index=['cat','dog','bird']),
    'B':{'cat':3.14, 'dog':2.718, 'bird':1.618, 'goat':0.5772}}
df = pd.DataFrame(d)
df

        A       B
bird  3.0  1.6180
cat   1.0  3.1400
dog   2.0  2.7180
goat  NaN  0.5772

In [435]:
d = {'Undergrad' : pd.Series(['UMich', 'Stanford', 'Princeton', 'Columbia'],
                             index=['Ford', 'Hoover', 'Wilson', 'Obama']),
     'PhD' : {'Wilson':'Johns Hopkins'},
     'JD' : {'Ford':'Yale','Obama':'Harvard'},
     'Terms': pd.Series([1,1,2,2], index=['Ford', 'Hoover', 'Wilson', 'Obama']) }
presidents = pd.DataFrame(d)
presidents

             JD            PhD  Terms  Undergrad
Ford       Yale            NaN      1      UMich
Hoover      NaN            NaN      1   Stanford
Obama   Harvard            NaN      2   Columbia
Wilson      NaN  Johns Hopkins      2  Princeton

In [436]:
presidents.columns

Index([u'JD', u'PhD', u'Terms', u'Undergrad'], dtype='object')

In [437]:
presidents.index

Index([u'Ford', u'Hoover', u'Obama', u'Wilson'], dtype='object')

In [438]:
presidents['PhD']

Ford                NaN
Hoover              NaN
Obama               NaN
Wilson    Johns Hopkins
Name: PhD, dtype: object

In [439]:
type(presidents['PhD'])

pandas.core.series.Series

In [440]:
presidents['Years'] = 4*presidents['Terms']
presidents

             JD            PhD  Terms  Undergrad  Years
Ford       Yale            NaN      1      UMich      4
Hoover      NaN            NaN      1   Stanford      4
Obama   Harvard            NaN      2   Columbia      8
Wilson      NaN  Johns Hopkins      2  Princeton      8

In [441]:
presidents['Nobels'] = [0,0,1,1]
presidents

             JD            PhD  Terms  Undergrad  Years  Nobels
Ford       Yale            NaN      1      UMich      4       0
Hoover      NaN            NaN      1   Stanford      4       0
Obama   Harvard            NaN      2   Columbia      8       1
Wilson      NaN  Johns Hopkins      2  Princeton      8       1

In [442]:
presidents['Undergrad'][presidents['Terms']>1]

Obama      Columbia
Wilson    Princeton
Name: Undergrad, dtype: object

In [443]:
presidents

             JD            PhD  Terms  Undergrad  Years  Nobels
Ford       Yale            NaN      1      UMich      4       0
Hoover      NaN            NaN      1   Stanford      4       0
Obama   Harvard            NaN      2   Columbia      8       1
Wilson      NaN  Johns Hopkins      2  Princeton      8       1

In [444]:
presidents['Years'] = 4*presidents['Terms']
presidents

             JD            PhD  Terms  Undergrad  Years  Nobels
Ford       Yale            NaN      1      UMich      4       0
Hoover      NaN            NaN      1   Stanford      4       0
Obama   Harvard            NaN      2   Columbia      8       1
Wilson      NaN  Johns Hopkins      2  Princeton      8       1

In [445]:
presidents

             JD            PhD  Terms  Undergrad  Years  Nobels
Ford       Yale            NaN      1      UMich      4       0
Hoover      NaN            NaN      1   Stanford      4       0
Obama   Harvard            NaN      2   Columbia      8       1
Wilson      NaN  Johns Hopkins      2  Princeton      8       1

In [446]:
presidents['Fields Medals'] = 0
presidents

             JD            PhD  Terms  Undergrad  Years  Nobels  Fields Medals
Ford       Yale            NaN      1      UMich      4       0              0
Hoover      NaN            NaN      1   Stanford      4       0              0
Obama   Harvard            NaN      2   Columbia      8       1              0
Wilson      NaN  Johns Hopkins      2  Princeton      8       1              0

In [447]:
del presidents['Years']
presidents

             JD            PhD  Terms  Undergrad  Nobels  Fields Medals
Ford       Yale            NaN      1      UMich       0              0
Hoover      NaN            NaN      1   Stanford       0              0
Obama   Harvard            NaN      2   Columbia       1              0
Wilson      NaN  Johns Hopkins      2  Princeton       1              0

In [448]:
fields = presidents.pop('Fields Medals')

In [449]:
presidents

             JD            PhD  Terms  Undergrad  Nobels
Ford       Yale            NaN      1      UMich       0
Hoover      NaN            NaN      1   Stanford       0
Obama   Harvard            NaN      2   Columbia       1
Wilson      NaN  Johns Hopkins      2  Princeton       1

In [450]:
presidents.loc['Obama']

JD            Harvard
PhD               NaN
Terms               2
Undergrad    Columbia
Nobels              1
Name: Obama, dtype: object

In [451]:
presidents.iloc[1]

JD                NaN
PhD               NaN
Terms               1
Undergrad    Stanford
Nobels              0
Name: Hoover, dtype: object

In [452]:
presidents['JD']

Ford         Yale
Hoover        NaN
Obama     Harvard
Wilson        NaN
Name: JD, dtype: object

In [453]:
presidents[1:3]

             JD  PhD  Terms Undergrad  Nobels
Hoover      NaN  NaN      1  Stanford       0
Obama   Harvard  NaN      2  Columbia       1

In [454]:
presidents[presidents['Terms']<2]

          JD  PhD  Terms Undergrad  Nobels
Ford    Yale  NaN      1     UMich       0
Hoover   NaN  NaN      1  Stanford       0

In [455]:
type(presidents['PhD']['Obama'])

float

In [456]:
presidents[['JD','PhD']]

             JD            PhD
Ford       Yale            NaN
Hoover      NaN            NaN
Obama   Harvard            NaN
Wilson      NaN  Johns Hopkins

In [457]:
df1 = pd.DataFrame(np.random.randn(8, 4), columns=['A', 'B', 'C', 'D'])
df2 = pd.DataFrame(np.random.randn(5, 3), columns=['A', 'B', 'C'])
df1+df2

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN
6       NaN       NaN       NaN NaN
7       NaN       NaN       NaN NaN

In [458]:
df = pd.DataFrame(np.random.randn(4, 2), columns=['A', 'B'])
df

          A         B
0 -0.823823  0.974845
1 -0.468764 -0.708804
2 -0.448012  0.773794
3  1.289806 -0.491059

In [459]:
df - df.iloc[0]

          A         B
0  0.000000  0.000000
1  0.355059 -1.683649
2  0.375810 -0.201051
3  2.113629 -1.465904

In [460]:
df.iloc[0]

A   -0.823823
B    0.974845
Name: 0, dtype: float64

In [461]:
df

          A         B
0 -0.823823  0.974845
1 -0.468764 -0.708804
2 -0.448012  0.773794
3  1.289806 -0.491059

In [462]:
10*df + 1

           A          B
0  -7.238226  10.748450
1  -3.687640  -6.088038
2  -3.480122   8.737945
3  13.898065  -3.910592

In [463]:
df > 0

       A      B
0  False   True
1  False  False
2  False   True
3   True  False

In [464]:
df

          A         B
0 -0.823823  0.974845
1 -0.468764 -0.708804
2 -0.448012  0.773794
3  1.289806 -0.491059

In [465]:
df.T*df.T

          0         1         2         3
A  0.678684  0.219740  0.200715  1.663601
B  0.950323  0.502403  0.598758  0.241139

In [466]:
df.T.dot(df)

          A         B
A  2.762739 -1.450878
B -1.450878  2.292623

In [467]:
df.dot(pd.Series(np.arange(1,5)))

ValueError: matrices are not aligned

In [468]:
pd.Series(np.arange(1,5)).dot(df)

A    2.053839
B   -0.085616
dtype: float64

In [469]:
df.dot(pd.Series(np.arange(1,3)))

ValueError: matrices are not aligned

In [470]:
baseball = pd.read_csv('baseball.csv')
type(baseball.info())

<class 'pandas.core.frame.DataFrame'>
Int64Index: 21699 entries, 4 to 89534
Data columns (total 22 columns):
id       21699 non-null object
year     21699 non-null int64
stint    21699 non-null int64
team     21699 non-null object
lg       21634 non-null object
g        21699 non-null int64
ab       21699 non-null int64
r        21699 non-null int64
h        21699 non-null int64
X2b      21699 non-null int64
X3b      21699 non-null int64
hr       21699 non-null int64
rbi      21687 non-null float64
sb       21449 non-null float64
cs       17174 non-null float64
bb       21699 non-null int64
so       20394 non-null float64
ibb      14171 non-null float64
hbp      21322 non-null float64
sh       20739 non-null float64
sf       14309 non-null float64
gidp     16427 non-null float64
dtypes: float64(9), int64(10), object(3)
memory usage: 3.8+ MB

NoneType

In [471]:
baseball.head()

,id,year,stint,team,lg,g,ab,r,h,X2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN
44,forceda01,1871,1,WS3,NaN,32,162,45,45,9,...,29.0,8.0,0.0,4,0.0,NaN,NaN,NaN,NaN,NaN
68,mathebo01,1871,1,FW1,NaN,19,89,15,24,3,...,10.0,2.0,1.0,2,0.0,NaN,NaN,NaN,NaN,NaN
99,startjo01,1871,1,NY2,NaN,33,161,35,58,5,...,34.0,4.0,2.0,3,0.0,NaN,NaN,NaN,NaN,NaN
102,suttoez01,1871,1,CL1,NaN,29,128,35,45,3,...,23.0,3.0,1.0,1,0.0,NaN,NaN,NaN,NaN,NaN

In [472]:
baseball.head(10)

,id,year,stint,team,lg,g,ab,r,h,X2b,...,rbi,sb,cs,bb,so,ibb,hbp,sh,sf,gidp
4,ansonca01,1871,1,RC1,NaN,25,120,29,39,11,...,16.0,6.0,2.0,2,1.0,NaN,NaN,NaN,NaN,NaN
44,forceda01,1871,1,WS3,NaN,32,162,45,45,9,...,29.0,8.0,0.0,4,0.0,NaN,NaN,NaN,NaN,NaN
68,mathebo01,1871,1,FW1,NaN,19,89,15,24,3,...,10.0,2.0,1.0,2,0.0,NaN,NaN,NaN,NaN,NaN
99,startjo01,1871,1,NY2,NaN,33,161,35,58,5,...,34.0,4.0,2.0,3,0.0,NaN,NaN,NaN,NaN,NaN
102,suttoez01,1871,1,CL1,NaN,29,128,35,45,3,...,23.0,3.0,1.0,1,0.0,NaN,NaN,NaN,NaN,NaN
106,whitede01,1871,1,CL1,NaN,29,146,40,47,6,...,21.0,2.0,2.0,4,1.0,NaN,NaN,NaN,NaN,NaN
113,yorkto01,1871,1,TRO,NaN,29,145,36,37,5,...,23.0,2.0,2.0,9,1.0,NaN,NaN,NaN,NaN,NaN
121,ansonca01,1872,1,PH1,NaN,46,217,60,90,10,...,50.0,6.0,6.0,16,3.0,NaN,NaN,NaN,NaN,NaN
143,burdoja01,1872,1,BR2,NaN,37,174,26,46,3,...,15.0,0.0,1.0,1,1.0,NaN,NaN,NaN,NaN,NaN
167,forceda01,1872,1,TRO,NaN,25,130,40,53,11,...,16.0,2.0,2.0,1,0.0,NaN,NaN,NaN,NaN,NaN

In [473]:
df

          A         B
0 -0.823823  0.974845
1 -0.468764 -0.708804
2 -0.448012  0.773794
3  1.289806 -0.491059

In [474]:
df.values

array([[-0.82382255,  0.97484503],
       [-0.46876395, -0.70880385],
       [-0.44801224,  0.77379448],
       [ 1.28980649, -0.4910592 ]])

In [475]:
df

          A         B
0 -0.823823  0.974845
1 -0.468764 -0.708804
2 -0.448012  0.773794
3  1.289806 -0.491059

In [476]:
(df > 0).any()

A    True
B    True
dtype: bool

In [477]:
(df > 0).all()

A    False
B    False
dtype: bool

In [478]:
df or df

ValueError: The truth value of a DataFrame is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [479]:
df = (df1 + df2).iloc[0:6]
df

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN

In [480]:
df1 = 2*df
df2 = df+df
(df1==df2).all()

A    False
B    False
C    False
D    False
dtype: bool

In [481]:
np.nan == np.nan

False

In [482]:
df1.equals(df2)

True

In [483]:
df

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN

In [484]:
np.nanmean(np.array(df.iloc[1]))

0.2035400925670062

In [485]:
df.mean(0)

A   -0.650501
B    1.365380
C    0.963280
D         NaN
dtype: float64

In [486]:
df.mean(1)

0   -0.024010
1    0.203540
2    0.913352
3    0.724750
4    0.979299
5         NaN
dtype: float64

In [487]:
df.var(0)

A    1.195989
B    0.912349
C    1.685834
D         NaN
dtype: float64

In [488]:
df.max(1)

0    2.008502
1    1.413845
2    2.514642
3    2.632520
4    2.063898
5         NaN
dtype: float64

In [489]:
df

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN

In [490]:
df.describe()

              A         B         C    D
count  5.000000  5.000000  5.000000  0.0
mean  -0.650501  1.365380  0.963280  NaN
std    1.093613  0.955170  1.298397  NaN
min   -2.355583  0.275049 -0.423190  NaN
25%   -1.017737  0.559467  0.125502  NaN
50%   -0.380035  1.413845  0.473065  NaN
75%    0.099913  2.063898  2.008502  NaN
max    0.400935  2.514642  2.632520  NaN

In [491]:
df

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN

In [492]:
df.apply(np.mean)

A   -0.650501
B    1.365380
C    0.963280
D         NaN
dtype: float64

In [493]:
df.apply(np.mean, axis=1)

0   -0.024010
1    0.203540
2    0.913352
3    0.724750
4    0.979299
5         NaN
dtype: float64

In [494]:
df

          A         B         C   D
0 -2.355583  0.275049  2.008502 NaN
1 -0.380035  1.413845 -0.423190 NaN
2  0.099913  2.514642  0.125502 NaN
3 -1.017737  0.559467  2.632520 NaN
4  0.400935  2.063898  0.473065 NaN
5       NaN       NaN       NaN NaN

In [495]:
df.apply(np.exp)

          A          B          C   D
0  0.094838   1.316596   7.452149 NaN
1  0.683838   4.111736   0.654954 NaN
2  1.105075  12.362182   1.133717 NaN
3  0.361412   1.749740  13.908773 NaN
4  1.493220   7.876610   1.604905 NaN
5       NaN        NaN        NaN NaN

In [496]:
df = pd.DataFrame(np.random.randn(5, 3),
                  columns=['A', 'B', 'C'])
df

          A         B         C
0  0.398835  0.419788  0.475352
1 -0.537891  2.409609  0.955949
2 -0.213365 -2.372218 -1.341288
3 -0.408697 -1.197577 -0.586425
4 -1.516515  1.217618 -0.052451

In [497]:
def quadratic(x, a, b, c=1):
    return a*x**2 + b*x + c
df.apply(quadratic, args=(1,2), c=5)

          A          B         C
0  5.956739   6.015798  6.176662
1  4.213545  15.625432  7.825736
2  4.618794   5.882984  4.116478
3  4.349639   4.039037  4.171044
4  4.266788   8.917831  4.897849

In [498]:
tsdf = pd.DataFrame(np.random.randn(10, 3),
                    columns=['DOW', 'NASDAQ', 'S&P500'],
                    index=pd.date_range('1/1/2000', periods=10))
tsdf.head()

                 DOW    NASDAQ    S&P500
2000-01-01 -0.028978 -0.214349 -1.738331
2000-01-02  0.492456 -0.755257 -0.943864
2000-01-03 -0.097807  0.172287  0.594903
2000-01-04 -0.393687  0.070030  0.540708
2000-01-05  0.207237  0.726468 -1.130498

In [499]:
tsdf.agg([np.median, np.mean, np.std])

             DOW    NASDAQ    S&P500
median  0.017290  0.239684 -0.419029
mean   -0.009528  0.397841 -0.486261
std     0.516480  0.759819  0.737427

In [500]:
tsdf.head()

                 DOW    NASDAQ    S&P500
2000-01-01 -0.028978 -0.214349 -1.738331
2000-01-02  0.492456 -0.755257 -0.943864
2000-01-03 -0.097807  0.172287  0.594903
2000-01-04 -0.393687  0.070030  0.540708
2000-01-05  0.207237  0.726468 -1.130498

In [501]:
tsdf.agg({'DOW':'mean',
          'NASDAQ':'median',
          'S&P500':'max'})

NASDAQ    0.239684
S&P500    0.594903
DOW      -0.009528
dtype: float64

In [502]:
df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [1., 2., 3.],
                   'C': ['foo', 'bar', 'baz']})
df

   A    B    C
0  1  1.0  foo
1  2  2.0  bar
2  3  3.0  baz

In [503]:
df.agg(['mean', 'max'])

        A    B    C
max   3.0  3.0  foo
mean  2.0  2.0  NaN

In [505]:
df = pd.DataFrame({'A': ['cat', 'dog', 'bird'],
                   'B': ['unicorn','chupacabra','pixie']})
df

      A           B
0   cat     unicorn
1   dog  chupacabra
2  bird       pixie

In [507]:
df.apply(lambda s:s.upper())

AttributeError: ("'Series' object has no attribute 'upper'", u'occurred at index A')

In [508]:
df

      A           B
0   cat     unicorn
1   dog  chupacabra
2  bird       pixie

In [509]:
df.applymap(lambda s:s.upper())

      A           B
0   CAT     UNICORN
1   DOG  CHUPACABRA
2  BIRD       PIXIE

In [510]:
df

      A           B
0   cat     unicorn
1   dog  chupacabra
2  bird       pixie

In [512]:
df['B'].map(lambda s:len(s))

0     7
1    10
2     5
Name: B, dtype: int64

In [518]:
s = pd.Series(['dog','goat','skunk'])
s

0      dog
1     goat
2    skunk
dtype: object

In [519]:
s.map(lambda s:len(s))

0    3
1    4
2    5
dtype: int64

In [522]:
s = pd.Series(['fruit', 'animal', 'animal', 'fruit', 'fruit'],
              index=['apple','cat', 'goat','banana','kiwi'])
s

apple      fruit
cat       animal
goat      animal
banana     fruit
kiwi       fruit
dtype: object

In [523]:
t = pd.Series({'fruit':0,'animal':1})
s.map(t)

apple     0
cat       1
goat      1
banana    0
kiwi      0
dtype: int64

In [524]:
f = lambda x:x**2
g = lambda x:x+1
h = lambda x:2*x
df = pd.DataFrame(np.random.randn(5, 3),
                  columns=['A', 'B', 'C'])
df

          A         B         C
0 -2.072339 -1.282539 -1.241128
1 -0.587874  0.517591 -0.394561
2 -0.164436  1.450398 -0.975424
3 -1.215576 -0.671235  0.394053
4 -0.350299  1.958805  0.467778

In [526]:
h(g(f(df)))

           A         B         C
0  10.589182  5.289812  5.080798
1   2.691193  2.535802  2.311357
2   2.054078  6.207308  3.902906
3   4.955251  2.901113  2.310556
4   2.245419  9.673833  2.437633

In [528]:
df.pipe(f).pipe(g).pipe(h)

           A         B         C
0  10.589182  5.289812  5.080798
1   2.691193  2.535802  2.311357
2   2.054078  6.207308  3.902906
3   4.955251  2.901113  2.310556
4   2.245419  9.673833  2.437633

In [529]:
df

          A         B         C
0 -2.072339 -1.282539 -1.241128
1 -0.587874  0.517591 -0.394561
2 -0.164436  1.450398 -0.975424
3 -1.215576 -0.671235  0.394053
4 -0.350299  1.958805  0.467778

In [530]:
s

apple      fruit
cat       animal
goat      animal
banana     fruit
kiwi       fruit
dtype: object

In [531]:
for x in s:
    print x

fruit
animal
animal
fruit
fruit

In [532]:
df

          A         B         C
0 -2.072339 -1.282539 -1.241128
1 -0.587874  0.517591 -0.394561
2 -0.164436  1.450398 -0.975424
3 -1.215576 -0.671235  0.394053
4 -0.350299  1.958805  0.467778

In [533]:
for x in df:
    print x

A
B
C

In [543]:
for x in df.iterrows():
    print(type(x[1]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>

In [539]:
for x in df.iteritems():
    print(x)

('A', 0   -2.072339
1   -0.587874
2   -0.164436
3   -1.215576
4   -0.350299
Name: A, dtype: float64)
('B', 0   -1.282539
1    0.517591
2    1.450398
3   -0.671235
4    1.958805
Name: B, dtype: float64)
('C', 0   -1.241128
1   -0.394561
2   -0.975424
3    0.394053
4    0.467778
Name: C, dtype: float64)

In [547]:
df = (df1 + df2).iloc[0:6]
df['A'][5]=1.12345
df['B'][5]=3.14159
df

          A          B          C   D
0 -9.422331   1.100197   8.034010 NaN
1 -1.520140   5.655382  -1.692761 NaN
2  0.399654  10.058568   0.502007 NaN
3 -4.070947   2.237868  10.530079 NaN
4  1.603739   8.255591   1.892258 NaN
5  1.123450   3.141590        NaN NaN

In [551]:
df.dropna(axis=1,how='any')

          A          B
0 -9.422331   1.100197
1 -1.520140   5.655382
2  0.399654  10.058568
3 -4.070947   2.237868
4  1.603739   8.255591
5  1.123450   3.141590

In [552]:
df.dropna(axis=1,how='all')

          A          B          C
0 -9.422331   1.100197   8.034010
1 -1.520140   5.655382  -1.692761
2  0.399654  10.058568   0.502007
3 -4.070947   2.237868  10.530079
4  1.603739   8.255591   1.892258
5  1.123450   3.141590        NaN